app/controllers/posts_controller.rb

UPDATE "posts" SET "title" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "Workshop"], ["updated_at", 2016-08-24 18:01:06 UTC], ["id", 4]]
---
  def update

  	if @post.update(post_params)